/************************************************************
 * 文件：Implement.c

************************************************************/

/************************* 头文件 *************************/

#include "Implement.h"

/************************* 宏定义 *************************/

/************************ 变量定义 ************************/
float Temp,Hum;
/************************ 函数定义 ************************/

/************************************************************ 
 * 函数:       Version_Type(char *str,u8 *asc,u8 n)
 * 说明:       程序版本 产品型号写入函数
************************************************************/
//void Version_Type(const char *str,u8 *asc)
//{
//	int i,k;
//	// 将字符串的每个字符逐个赋值给整型数组AsciiNum，即实现字符到ASCII码值的转换
//	for(i=0; i<strlen(str); i++)  
//	{
//		asc[i] = str[i];  // 最后数组AsciiNum就是字符串每个字符所对应ASCII码值的数组
//	}
//	for(k=0; k<strlen(str); k++)  
//	{
//		MODS_WriteRegValue(SLAVE_REG_P02+0x01*k,BEBufToUint16(&asc[0+2*k])); 	
//	}	
//	
//}
/************************************************************ 
 * 函数:       System_Init(void)
 * 说明:       系统初始化
************************************************************/

	void System_Init(void)
		{
			rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
			rcu_periph_clock_enable(RCU_AF);   //管脚复用时钟alternate function clock使能
			systick_config();

			delay_1ms(200); 
		}

/************************************************************ 
 * 函数:       Implement(void)
 * 说明:       执行函数
************************************************************/

	void Implement(void)
		{

			
			
			SHT3x_Init();
			
			while(1)
				{	
					
					ReadSHT3x(0x44);

				}
	   }


/****************************End*****************************/

